In [4]:
f1 = (10,20.4,'a',[10,30])
type(f1)

tuple

In [3]:
f4 ={10,20,30}
type(f4)

set

In [ ]:
f5 =60

In [ ]:
f2 =[10,20,30]
f2

In [2]:
f3 = 10.4
type(f3)

float

In [ ]:
mytuple[
2
:
5
]

In [5]:
g ={10:100,10:500}
g

dict

In [6]:
g ={'a':20.89,30:'apple'}
g

{30: 'apple', 'a': 20.89}

In [7]:
len(g)

2

In [9]:
g ={'a':[30,40],30:(40,50,60),60:{40},70:{40:45}}
len(g)

4

In [11]:
g ={'a':20.89,30:'apple'}
g[30]

'apple'

In [12]:
g.keys()

dict_keys(['a', 30])

In [13]:
g.values()

dict_values([20.89, 'apple'])

In [15]:
g ={'a':[30,40],30:(40,50,60),60:{40},70:{40:45}}
g['a'][1]

40

In [18]:
g ={'a':20.89,30:'apple'}
g[30] =300
g
g['b'] =500
g

{30: 300, 'a': 20.89, 'b': 500}

In [19]:
g.pop('a')

20.89

In [20]:
g

{30: 300, 'b': 500}

In [21]:
g.clear()

In [22]:
g

{}

In [23]:
g = {'a':20.89,30:'apple'}
'a' in g

True

In [26]:
mystr4 ="one two three"
mystr4.split()

['one', 'two', 'three']

In [ ]:
name ='Monish'
print('Hi {}, Welcome'.format(name))

In [4]:
import os
print(os.getcwd())
import sys

C:\Users\Raja

In [6]:
print(100/0)

ZeroDivisionError: division by zero

In [9]:
try :
    print(100/10)
except :
    print(sys.exc_info()[1],'exception occured')
else:
    print('no exception occured')
finally:
    print('code executed')

10.0
no exception occured
code executed

In [10]:
x

NameError: name 'x' is not defined

In [11]:
x =4
 y=5

IndentationError: unexpected indent (<ipython-input-11-70e87757e04c>, line 2)

In [14]:
import csv
with open("C:\\Users\\Raja\\Desktop\\SAMPLE.csv") as file:
    reader = csv.reader(file)
    for row in reader:
        print(row)

['name', 'age']
['A', '20']
['B', '30']

In [17]:
with open("C:\\Users\\Raja\\Desktop\\SAMPLE.csv") as file:
    reader = csv.DictReader(file)
    for row in reader:
#         print(row)
        print(row['age'])

20
30

In [25]:
with open("C:\\Users\\Raja\\Desktop\\SAMPLE.csv",'a') as file:
    fieldnames = ['name','age']
    writer = csv.DictWriter(file,fieldnames =fieldnames)
#     writer.writeheader()
    writer.writerow({'name':'e','age':40})

In [44]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 30,15], index=['a', 'b', 'c','d']),
'two' : pd.Series([1, 2, 31, 4,45], index=['a', 'b', 'c', 'd','e']),
     'name':(["ragul","raja","ram","david",'sam'])}
df = pd.DataFrame(d)
df

    name   one  two
a  ragul   1.0    1
b   raja   2.0    2
c    ram  30.0   31
d  david  15.0    4
e    sam   NaN   45

In [34]:
df.columns =['dummy1','dummy2']
df

   dummy1  dummy2
a     1.0       1
b     2.0       2
c    30.0      31
d     NaN       4

In [35]:
df.to_csv('raghul.csv')

In [31]:
df.loc['d']

one    NaN
two    4.0
Name: d, dtype: float64

In [32]:
df.iloc[1]

one    2.0
two    2.0
Name: b, dtype: float64

In [9]:
df.describe()

             one        two
count   3.000000   4.000000
mean   11.000000   9.500000
std    16.462078  14.387495
min     1.000000   1.000000
25%     1.500000   1.750000
50%     2.000000   3.000000
75%    16.000000  10.750000
max    30.000000  31.000000

In [7]:
df.describe(include="all")

       name        one        two
count     4   3.000000   4.000000
unique    4        NaN        NaN
top     ram        NaN        NaN
freq      1        NaN        NaN
mean    NaN  11.000000   9.500000
std     NaN  16.462078  14.387495
min     NaN   1.000000   1.000000
25%     NaN   1.500000   1.750000
50%     NaN   2.000000   3.000000
75%     NaN  16.000000  10.750000
max     NaN  30.000000  31.000000

In [11]:
df['one'].mean()

11.0

In [16]:
df.loc['a'][1]

1.0

In [17]:
df.iloc[0:3]

    name   one  two
a  ragul   1.0    1
b   raja   2.0    2
c    ram  30.0   31

In [18]:
df.iloc[:,0:2]

    name   one
a  ragul   1.0
b   raja   2.0
c    ram  30.0
d  david   NaN

In [19]:
df = df.assign(percentage=lambda x:(x['one']*100))
df

    name   one  two  percentage
a  ragul   1.0    1       100.0
b   raja   2.0    2       200.0
c    ram  30.0   31      3000.0
d  david   NaN    4         NaN

In [20]:
df['percentage'] = df['one']*100
df

    name   one  two  percentage
a  ragul   1.0    1       100.0
b   raja   2.0    2       200.0
c    ram  30.0   31      3000.0
d  david   NaN    4         NaN

In [72]:
df.sort_values(by=['one','two'])

one two
10 20 2)
10 10 1)

    name   one  two
c    ram  30.0   31
d  david  15.0    4
b   raja   2.0    2
a  ragul   1.0    1
e    sam   NaN   45

In [25]:
df.isnull().sum()

name          0
one           1
two           0
percentage    1
dtype: int64

In [26]:
df.dropna()

    name   one  two  percentage
a  ragul   1.0    1       100.0
b   raja   2.0    2       200.0
c    ram  30.0   31      3000.0

In [27]:
df[df['name']=="ragul"]

    name  one  two  percentage
a  ragul  1.0    1       100.0

In [ ]:
function1(['americans','fiat'])

In [30]:
df[df['name'].isin(['ragul','ram'])]

    name   one  two  percentage
a  ragul   1.0    1       100.0
c    ram  30.0   31      3000.0

In [117]:
df.drop_duplicates(keep='last')

    name   one  two
a  ragul   1.0    1
b   raja   2.0    2
c    ram  30.0   31
d  david  15.0    4
e    sam   NaN   45

In [42]:
df[(df['one']>10) | (df['one']<20)]

    name  one  two
a  ragul    1    1
b   raja    2    2
c    ram   30   31
d  david   15    4
e    sam   45   45

In [45]:
df[df['one'].notna()]

    name   one  two
a  ragul   1.0    1
b   raja   2.0    2
c    ram  30.0   31
d  david  15.0    4

In [51]:
df1 = df[['one','two']]
df1

    one  two
a   1.0    1
b   2.0    2
c  30.0   31
d  15.0    4
e   NaN   45

In [46]:
df.iloc[0:2,1:2]

   one
a  1.0
b  2.0

In [50]:
import numpy as np
df1.apply(np.sqrt)

        one       two
a  1.000000  1.000000
b  1.414214  1.414214
c  5.477226  5.567764
d  3.872983  2.000000
e       NaN  6.708204

In [54]:
df1.apply(np.sum,axis=1)

a     2.0
b     4.0
c    61.0
d    19.0
e    45.0
dtype: float64

In [61]:
df1

    one  two
a   1.0    1
b   2.0    2
c  30.0   31
d  15.0    4
e   NaN   45

In [62]:
new_index=['c','a','b']
df1.reindex(new_index)

    one  two
c  30.0   31
a   1.0    1
b   2.0    2

In [65]:
df1.fillna('missing')

       one  two
a        1    1
b        2    2
c       30   31
d       15    4
e  missing   45

In [66]:
df.reset_index()

  index   name   one  two
0     a  ragul   1.0    1
1     b   raja   2.0    2
2     c    ram  30.0   31
3     d  david  15.0    4
4     e    sam   NaN   45

In [70]:
df.select_dtypes(include=np.number)

    one  two
a   1.0    1
b   2.0    2
c  30.0   31
d  15.0    4
e   NaN   45

In [96]:
df2 = pd.DataFrame({'Animal':['lion','lion','Tiger','Tiger'],
                  'speed':[100,200,300,'']})
df2
df2 = df2.replace(r'^\s*$',np.nan,regex=True)
df2
df4 = df2.groupby(by =['Animal']).mean()
df4
# df3.reset_index()

        speed
Animal
Tiger   300.0
lion    150.0

In [ ]:
pd.read_csv('path')
pd.read_excel('path',sheet_name = "")

In [109]:
df4 = pd.DataFrame({'State':['TN','TN','AP','AP','TN'],'last_name':['a','b','c','d','e']})
df5 = df4.groupby(['State'])['last_name'].count()
df5.reset_index()

  State  last_name
0    AP          2
1    TN          3

In [ ]:
df3 = pd.DatFrame('a':[])

In [118]:
df1 = pd.DataFrame({'First_name':['Raghul','Ram','Raja','Raghul'],'Mark1':[70,75,72,70]})

df2 = pd.DataFrame({'Last_name':['Ram','Raja','Raghul'],'Mark2':[40,50,30]})
pd.merge(df1,df2,left_on='First_name',right_on="Last_name",how='left')

  First_name  Mark1 Last_name  Mark2
0     Raghul     70    Raghul     30
1        Ram     75       Ram     40
2       Raja     72      Raja     50
3     Raghul     70    Raghul     30

In [121]:
df1.drop_duplicates(keep='last')

  First_name  Mark1
1        Ram     75
2       Raja     72
3     Raghul     70

In [115]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
First_name    3 non-null object
Mark1         3 non-null int64
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes